import { React } from "jimu-core";
import { useState } from "react";
import AboutUsTable from "./AboutUsTable";
import "./../../index.css";

const Widget = () => {
  const [dataError, setDataError] = useState(false);

  return (
    <div className="about-wrapper">
      <div className="container">
        <h1 className="about-title"> Σχετικά με </h1>

        <p>
          Στα πλαίσια, του έργου{" "}
          <a
            className="about-link"
            href="https://www.adaptivegreece.gr/el-gr/"
            target="_blank"
            rel="noreferrer"
          >
            {" "}
            ‘LIFE-IP AdaptInGR - Boosting the implementation of adaptation
            policy across Greece - LIFE17 IPC/GR/000006’{" "}
          </a>
          και στην κατασκευή του ηλεκτρονικού πληροφοριακού κόμβου για την
          προσαρμογή στην Κλιματική Αλλαγή προβλέπεται η δημιουργία του
          εργαλείου απεικόνισης γεωγραφικών δεδομένων. Στο παρόν διαδικτυακό
          εργαλείο χαρτογραφικής απεικόνισης παρουσιάζονται τα αποτελέσματα των
          προβλέψεων για την Κλιματική Αλλαγή με απλό και κατανοητό τρόπο με
          χρήση χαρτών και γραφημάτων, με σκοπό την ενίσχυση της κατανόησης των
          επιπτώσεων της αλλαγής του κλίματος, την υποστήριξη της ανάλυσης των
          επιπτώσεων της Κλιματικής Αλλαγής και τον σχεδιασμό πολιτικών και
          μέτρων προσαρμογής. <br />
          Τα εν λόγω κλιματικά δεδομένα έχουν παραχθεί για 2 μελλοντικές
          περιόδους <b>2031-2060</b> (εγγύς μέλλον) και <b>2071-2100</b>{" "}
          (απώτερο μέλλον) με περίοδο αναφοράς την περίοδο <b>1971-2000</b>{" "}
          (παρόν κλίμα). Οι μελλοντικές κλιματικές προβολές βασίζονται σε 3
          σενάρια εκπομπών αερίων του θερμοκηπίου (Representative Concentration
          Pathways) της IPCC: το αυστηρό σενάριο μετριασμού (<b>RCP 2.6</b>), το
          ενδιάμεσο σενάριο μετριασμού (<b>RCP4.5</b>) και τέλος το ακραίο
          σενάριο με πολύ υψηλές εκπομπές αεριών του θερμοκηπίου (<b>RCP8.5</b>
          ). Στην περίπτωση απουσίας πρόσθετων μέτρων για τον περιορισμό των
          εκπομπών αερίων του θερμοκηπίου, αναμένεται να επαληθευτεί το σενάριο
          RCP8.5, ενώ, στην περίπτωση του σεναρίου RCP2.6 η αύξηση της
          θερμοκρασίας αναμένεται να συγκρατηθεί κάτω των 2°C σε σχέση με τα
          προβιομηχανικά επίπεδα. <br /> Συγκεκριμένα:
        </p>

        <ul className="about-list">
          <li>
            {" "}
            Το σενάριο RCP 2.6 βασίζεται στην υπόθεση ότι το μέγιστο των
            παγκόσμιων εκπομπών αερίων του θερμοκηπίου συνέβη κατά την
            προηγούμενη δεκαετία 2010-2020, ενώ στη συνέχεια θα ακολουθήσει
            σημαντική μείωση.
          </li>
          <li>
            {" "}
            Σύμφωνα με το σενάριο RCP 4.5, οι εκπομπές αερίων του θερμοκηπίου θα
            αυξάνονται μέχρι το 2040 και μετά θα μειωθούν. Τέλος, με βάση το
            σενάριο RCP 8.5 οι παγκόσμιες εκπομπές αερίων του θερμοκηπίου θα
            συνεχίσουν να αυξάνονται καθ’ όλη τη διάρκεια του 21ου αιώνα.
          </li>
        </ul>

        <hr className="about-hr" />

        <p>
          Το Εθνικό Αστεροσκοπείο Αθηνών σε συνεργασία με την Ακαδημία Αθηνών ως
          εταίροι του έργου παρήγαγαν κλιματικές προβολές από τη μέση τιμή{" "}
          <b>
            7 επιλεγμένων ζευγών παγκόσμιων (GCMs) / περιοχικών κλιματικών
            μοντέλων (RCMs) αιχμής{" "}
          </b>{" "}
          τα οποία αναπτύχθηκαν στο πλαίσιο του προγράμματος{" "}
          <a
            className="about-link"
            href="https://www.euro-cordex.net/"
            target="_blank"
            rel="noreferrer"
          >
            EURO-CORDEX
          </a>{" "}
          και είναι διαθέσιμα μέσω του Climate Data Store (CDS) του Copernicus
          Climate Change Service (C3S) με οριζόντια χωρική ανάλυση περίπου
          0.11°. H χωρική ανάλυση των χαρτών που παράχθηκαν βάσει των κλιματικών
          προβολών είναι 500m, κατόπιν εφαρμογής μεθόδων χωρικής παρεμβολής στα
          αρχικά δεδομένα των μοντέλων. Τα αποτελέσματα των μοντέλων
          παρουσιάζονται στο εργαλείο τόσο ως απόλυτες τιμές όσο και ως διαφορές
          από το παρόν κλίμα.
        </p>

        <hr className="about-hr" />

        <p className="mb-5">
          <b>
            {" "}
            Τα ζεύγη των GCMs/RCMs που χρησιμοποιήθηκαν καταγράφονται στον
            πίνακα που ακολουθεί:
          </b>
        </p>

        <AboutUsTable />

        <hr className="about-hr" />

        <p className="mb-5">
          <b>
            {" "}
            Oι δείκτες για τους οποίους έχουν παραχθεί κλιματικές προβολές και
            αφορούν τον κλιματικό μέσο όρο της αντίστοιχης τριακονταετίας, είναι
            οι ακόλουθοι:{" "}
          </b>
        </p>

        <ol className="about-list">
          <li> Μέση ετήσια θερμοκρασία (°C) - TG</li>
          <li> Μέση ετήσια ελάχιστη θερμοκρασία (°C) - TN</li>
          <li> Μέση ετήσια μέγιστη θερμοκρασία (°C) - TX</li>
          <li> Αριθμός ημερών ανά έτος με TX &gt; 30°C - θερμές ημέρες</li>
          <li> Αριθμός ημερών ανά έτος με TX &gt; 35°C - πολύ θερμές ημέρες</li>
          <li> Αριθμός ημερών με TN &gt; 20°C -τροπικές νύχτες</li>
          <li> Αριθμός ημερών ανά έτος με TN &lt; 0°C - νυχτερινός παγετός</li>
          <li>
            Αριθμός ημερών ανά έτος με TG &lt; 10°C - ισχυρές ανάγκες για
            θέρμανση
          </li>
          <li>
            Αριθμός ημερών ανά έτος με TG &gt; 30°C - ισχυρές ανάγκες για ψύξη
          </li>
          <li> Ολική ετήσια βροχόπτωση (mm) - PR *</li>
          <li>
            Μέγιστη διάρκεια διαδοχικών ημερών ανά έτος με PR &lt; 1mm - μέγιστη
            διάρκεια ξηρασίας σε ημέρες
          </li>
          <li>
            Αριθμός ημερών ανά έτος με PR &gt; 10mm - ημέρες ισχυρής βροχόπτωσης
            *
          </li>
          <li>
            Αριθμός ημερών ανά έτος PR &gt; 20mm - ημέρες πολύ ισχυρής
            βροχόπτωσης *
          </li>
          <li>
            {" "}
            Αριθμός ημερών ανά έτος με PR &gt; 1mm - ημέρες βροχόπτωσης *
          </li>
          <li>
            Αριθμός ημερών ανά έτος με PR &lt; 1mm - ημέρες χωρίς βροχόπτωση *
          </li>
          <li> Μέση ετήσια σχετική υγρασία (%)</li>
          <li> Μέση ετήσια ταχύτητα άνεμου (m/sec)</li>
          <li> Μέσο ετήσιο κλάσμα Νεφοκάλυψης (%)</li>
          <li>
            Μέση ετήσια εισερχόμενη μικρού μήκους κύματος ακτινοβολία (Watt/m2)
          </li>
          <li>
            Αριθμός ημερών ανά έτος με δείκτη δυσφορίας (humidex) &gt; 38°C
          </li>
          <li>
            Αριθμός ημερών ανά έτος με δείκτη δυσφορίας (humidex) &gt; 40°C
          </li>
          <li>
            Αριθμός ημερών ανά έτος με δείκτη δυσφορίας (humidex) &gt; 46°C
          </li>
          <li>
            Μέσος FWI (δείκτης κινδύνου δασικής πυρκαγιάς) αντιπυρικής περιόδου
            (Μάιος- Οκτώβριος)
          </li>
          <li>
            Αριθμός ημερών ανά έτος με ακραίο κίνδυνο εκδήλωσης δασικής
            πυρκαγιάς (FWI &gt; 50)
          </li>
        </ol>

        <p>
          * Σημειώνεται ότι στους δείκτες 10, 12, 13, 14 και 15 περιλαμβάνονται
          όλων των ειδών τα κατακρυμνίσματα.
        </p>

        <hr className="about-hr" />

        <p>
          Επιπλέον των ανωτέρω ετήσιων δεδομένων, παρουσιάζονται οι δείκτες
          θερμοκρασίας (1), βροχόπτωσης (10) και ταχύτητας ανέμου (17) σε
          εποχική βάση (χειμώνας, άνοιξη, καλοκαίρι, φθινόπωρο). <br />
          Επίσης παράχθηκε η εξέλιξη ανά πενταετία για τους δείκτες μέση ετήσια
          βροχόπτωση και μέση ετήσια θερμοκρασία για όλες τις πρωτεύουσες των
          νομών. Οι χρονοσειρές αυτές παρουσιάζονται τόσο για το παρόν κλίμα
          (μπλε γραμμή) όσο για τις μελλοντικές περιόδους (έως το 2100)
          χρησιμοποιώντας τα σενάρια εκπομπών αερίων του θερμοκηπίου (RCP 2.6,
          RCP 4.5 και RCP 8.5 με πράσινη, κίτρινη και κόκκινη γραμμή
          αντιστοίχως).
        </p>
      </div>
    </div>
  );
};

export default Widget;
